{
  "DateStamp": "2024-02-25T08:28:15.7134098-08:00",
  "Announcements": [
    {
      "Title": "TEMECULA, CA",
      "IsNew": false,
      "BodyText": " Regularly scheduled meetings 12:00 AM Location: Temecula, CA, USA There are no regular weekly meetings at this time, however, We do try to schedule several regular monthly meetings "
    },
    {
      "Title": "ONLINE DEBATE with ATHEIST",
      "IsNew": true,
      "BodyText": " Saturday, February 24th, 2024 5:00 PM Is Christianity True? Location: YouTube (Modern Day Debate) Found at YouTube, though the following line provided does not seem to be active yet. Hopefully it will be at the time of the event. "
    },
    {
      "Title": "ZOOM MEETING",
      "IsNew": false,
      "BodyText": "Monthly-1st Wednesdays Wednesday, March 6th, 2024 7:00 PM to 8:30 PM Open Q&A via ZOOM Location: Via ZOOM Portland, OR, USA ZOOM MEETING (1st WEDNESDAYS of each month) "
    },
    {
      "Title": "TEMECULA CA",
      "IsNew": true,
      "BodyText": "Men's Bible Study Saturday, March 16th, 2024 8:00 AM to 10:00 AM Through the New Testament Location: Love of Christ Christian Fellowship 41630 Winchester Rd, Temecula, CA 92590, USA The Men's Study is the 3rd Saturday each month unless otherwise noted. Due to travel and schedule conflicts, it is sometimes interrupted. Please periodically check the website for any updates. "
    },
    {
      "Title": "BUENA PARK CA",
      "IsNew": true,
      "BodyText": " Saturday, March 16th, 2024 6:00 PM to 8:00 PM Through the Bible - Overviews Location: The Way Fellowship 7142 Thomas St, Buena Park, CA 90621, USA The event regularly takes place on the 3rd Saturday night each month unless otherwise noted. Due to travel/ teaching schedule conflicts there can be interruptions, so please check the website periodically. "
    },
    {
      "Title": "BUENA PARK CA",
      "IsNew": false,
      "BodyText": "3rd Saturday nights each month Saturday, March 16th, 2024 6:00 PM to 8:30 PM Through the Bible-overviews Location: The Way Fellowship 7142 Thomas St, Buena Park, CA 90621, USA Refreshments are not provided, but feel free to bring something with you. "
    },
    {
      "Title": "NEW BOOKS & FREE AUDIO",
      "IsNew": true,
      "BodyText": "BOTH audio books now available Wednesday, May 1st, 2024 Empire of the Risen Son (1&2) Location: Temecula, CA, USA **** Steve's new book: \" Why NOT Full Preterism- a partial-preterist response to a novel theological innovation\" is now available. It is a treatise AGAINST the **** Full-Preterist view. We welcome and encourage reviews at Amazon. "
    },
    {
      "Title": "RADIO AUDIENCE ",
      "IsNew": true,
      "BodyText": "Call-in GUIDELINES Sunday, June 30th, 2024 RADIO CALL GUIDELINES Location: Address could not be located WHEN CALLING into the RADIO PROGRAM, PLEASE "
    }
  ]
}